{
    "CONTACT": "Brendon Tan | Mobile No.: (+65) 9662 5038 | Email: brendontan003@gmail.com",
    "EDUCATION": "EDUCATION Nanyang Technological University, Singapore Aug 2021 Dec 2024 Bachelor of Engineering (Computer Science) Expected Honours (Distinction), Current CGPA: 4.32/5.00",
    "PROJECTS": "PROJECTS Nanyang Technological University, Singapore Cloud Computing Project Jan 2023 Feb 2023 Built an AI chatbot to handle FAQs about NTU, achieving 90% response accuracy. Utilised technologies such as OpenAI's embedding model, Google Cloud's Vertex AI and ChromaDB to achieve a 95% reduction in tokens usage, significantly lowering operational costs and enhancing response accuracy.",
    "intern_experience_section": "INTERNSHIP EXPERIENCE DBS Bank Ltd May 2024 Aug 2024 Software Developer Intern Developed a translation tool for Hong Kong translators which integrates Gen-AI capabilities and Retrieval Augmented Generation (RAG) techniques, resulting in a 40% increase in productivity. Completed various front end development tasks using React and Ant Design UI library, including code refactoring and updating of deprecated content. Wrote extensive test cases using React Testing Library and performed regression testing as well as User Acceptance Testing (UAT). FoodLine.sg Pte Ltd Aug 2023 Dec 2023 Full Stack Software Developer Intern Engaged in full-stack web development, using PHP and JavaScript for server-side scripting, ensuring responsive backend functionalities. Integrated Zoho CRM into the backend application, streamlining customer-facing processes and enhancing lead management. Designed meticulous database schemas in MySQL and integrated them into the backend application, employing security techniques such as prepared statements and data sanitisation. Undercurrent Capital Pte Ltd May 2023 Aug 2023 Software Engineer Intern Implemented front-end interfaces for Decentralised Applications (DApps) using React and Tailwind CSS to ensure a seamless and user-friendly experience. Leveraged Pyteal and JavaScript to compose highly efficient and secure smart contracts for various DApps features such as transaction of digital assets and cryptocurrencies. Authored comprehensive test cases using Mocha Testing Framework and conducted end-to-end testing to ensure successful deployment.",
    "CCA": "CO-CURRICULAR ACTIVITIES Freshmen Orientation Programme Jan 2022 Aug 2022 Programmes Committee Member Participated in canvassing and managed to raise over $1000 for the orientation programme. Planned games and camp activities for 250 freshmen to encourage interaction and bonding.",
    "SKILLS": "SKILLS Languages: Proficient in English and Chinese Programming Languages: Python, ReactJS, Node.js, Java, C, HTML/CSS, PHP, JavaScript, SQL Software Applications: Android Studio, Jupyter Notebook, Microsoft Office, Git, Jira, BitBucket, Confluence Online Courses: DS102: Data Analytics with Python (Hackwagon Academy Pte Ltd), CodeIT Advanced (CodeIT Academy)",
    "ACHIEVEMENT": null,
    "INTEREST": null
}