{
    "CONTACT": "Brendon Tan | Mobile No.: (+65) 9662 5038 | Email: brendontan003@gmail.com",
    "EDUCATION": "EDUCATION Nanyang Technological University, Singapore Bachelor of Engineering (Computer Science), Aug 2021 - Dec 2024 Expected Honours (Distinction), Current CGPA: 4.32/5.00 Developed strong foundation in computer science, with coursework in data structures, algorithms, computer networks, and software engineering Utilized programming languages such as Java, Python, and JavaScript to build various projects and applications Designed and implemented efficient solutions to complex problems in group projects",
    "PROJECTS": "PROJECTS Cloud Computing Project Designed and developed a high-performance AI chatbot using OpenAI's embedding model, processing FAQs and achieving a 90% response accuracy. Utilized Google Cloud's Vertex AI and ChromaDB to optimize token usage, resulting in a 95% reduction in operational costs and enhanced response accuracy. Applied fundamental knowledge of Javascript (ES6+) and React concepts, showcasing strong problem-solving and debugging skills.",
    "intern_experience_section": "INTERN EXPERIENCE Software Developer Intern at DBS Bank Ltd Developed a scalability-enhancing translation tool utilizing Gen-AI capabilities and Retrieval Augmented Generation (RAG) techniques, resulting in a 40% productivity increase. Utilized React and Ant Design UI library for front-end development, including code refactoring, updating deprecated content, and writing extensive test cases with React Testing Library. Conducted thorough regression testing and User Acceptance Testing (UAT) to ensure software quality. Full Stack Software Developer Intern at FoodLine.sg Pte Ltd Designed and implemented a full-stack web application using PHP, JavaScript, and MySQL, ensuring responsive backend functionalities and streamlined customer-facing processes. Integrated Zoho CRM to enhance lead management and customer engagement. Created meticulous database schemas and employed security techniques such as prepared statements and data sanitisation to ensure data integrity. Software Engineer Intern at Undercurrent Capital Pte Ltd Designed and implemented user-friendly front-end interfaces for Decentralised Applications (DApps) using React and Tailwind CSS. Composed secure and efficient smart contracts using Pyteal and JavaScript for features such as digital asset and cryptocurrency transactions. Authored comprehensive test cases with Mocha Testing Framework and conducted end-to-end testing to ensure successful deployment.",
    "CCA": "CO-CURRICULAR ACTIVITIES Freshmen Orientation Programme Programmes Committee Member, January 2022 - August 2022 Designed and executed innovative fundraising strategies, exceeding the target by over $1000, demonstrating problem-solving skills and ability to work under tight deadlines. Led the planning and implementation of engaging games and camp activities for 250 freshmen, showcasing strong communication and collaboration skills, and ability to facilitate team-building and bonding. Developed and managed a budget, ensuring the success of the orientation programme, reflecting financial management skills.",
    "SKILLS": "SKILLS Language Skills: English - Proficient, Chinese - Proficient Programming Languages: JavaScript (ES6+), ReactJS Frameworks & Libraries: React Native, Redux, Flexbox, Styled-Components Technologies: Asynchronous Reactive Programming, API Calls, CI/CD Pipelines, Micro Front End Pattern, Jest, Detox",
    "ACHIEVEMENT": null,
    "INTEREST": null
}